[{"summary":"Free PDF worksheet with all of today's important questions, answers, vocabulary, sample conversations, and ideas to help you level up your English speaking skills. You can click on the link in the description to download this free PDF works sheet today.","gist":"Speak English With Vanessa","start":280,"end":43808,"additionalProperties":{},"id":"1a6b6818-0b73-4ffe-974b-24177ed1c962","headline":"Free PDF worksheet to help you improve your English speaking skills"},{"summary":"The first category is questions and answers about chores. Make sure you pronounce this correctly and it means things that you need to do to take care of your house and your home. It's important that everyone participates in the chores and taking care of the house.","gist":"Questions and Answers about Chores","start":43936,"end":201134,"additionalProperties":{},"id":"4e6eab03-896b-410a-8357-e3192ff10688","headline":"Questions and answers about chores can help improve your speaking skills"},{"summary":"All right, our next category are questions and answers related to your neighborhood. What made you choose to move here? Why here? And not anywhere else in the world? What's the best thing about this neighborhood?","gist":"Questions and Answers related to Your Neighborhood","start":202114,"end":347294,"additionalProperties":{},"id":"be6de0f0-6399-4ac0-8f9f-4ae216bf0418","headline":"Questions and answers related to your neighborhood are common conversation topics"},{"summary":"When you move to a new place, you're probably gonna have to do some renovations. A fixer upper means it's a house that has a good foundation. It's probably less expensive, and it means that you get to design it in the way that you like.","gist":"How to Win at Home Decorations","start":347454,"end":442688,"additionalProperties":{},"id":"5746ea6c-e363-4fdc-b4f0-4ce037860e0a","headline":"When you move to a new place, you're probably gonna do some renovations"},{"summary":"Listen to a sample conversation between my husband Dan and I. We're going to use the same questions and answers that you just learned in a little sample conversation. After the sample conversation, it will be your turn to speak with me.","gist":"Chores in the House","start":442856,"end":511044,"additionalProperties":{},"id":"3cf34864-e31f-4c56-b4c6-5ba6294aa083","headline":"Use these questions to help you understand chores inside your house and your neighborhood"},{"summary":"Use these questions to test your English speaking skills. The next step is to download the free PDF worksheet. At the bottom of the worksheet, you can answer Vanessa's challenge question.","gist":"Practicing Speaking With Me in English","start":511344,"end":621360,"additionalProperties":{},"id":"7f9f2ffd-5492-4e15-8c35-55db644da259","headline":"Use these questions to practice your English speaking skills"},{"summary":"Click on the link in the description to download that free PDF worksheet today. Watch this video next where you will learn to speak with me about the most common small talk conversation topic ever. You need to be able to talk about this in daily conversation. See you again next Friday for a new lesson.","gist":"The Weather","start":621472,"end":655134,"additionalProperties":{},"id":"f24fc5dd-e82b-4ba8-8c2f-af5029935350","headline":"Learn to speak with me about the most common small talk conversation topic"}]